HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSbcu_bf.h
/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_OFF (8)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU2 */
#define IFX_SBCU_DBGRNT_CPU2_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU2 */
#define IFX_SBCU_DBGRNT_CPU2_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU2 */
#define IFX_SBCU_DBGRNT_CPU2_OFF (9)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_OFF (0)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_OFF (15)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_OFF (5)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_OFF (2)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_OFF (13)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_OFF (12)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.HSSL */
#define IFX_SBCU_DBGRNT_HSSL_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.HSSL */
#define IFX_SBCU_DBGRNT_HSSL_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.HSSL */
#define IFX_SBCU_DBGRNT_HSSL_OFF (3)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE0 */
#define IFX_SBCU_DBGRNT_ONE0_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE0 */
#define IFX_SBCU_DBGRNT_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE0 */
#define IFX_SBCU_DBGRNT_ONE0_OFF (1)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE1 */
#define IFX_SBCU_DBGRNT_ONE1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE1 */
#define IFX_SBCU_DBGRNT_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE1 */
#define IFX_SBCU_DBGRNT_ONE1_OFF (4)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE2 */
#define IFX_SBCU_DBGRNT_ONE2_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE2 */
#define IFX_SBCU_DBGRNT_ONE2_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE2 */
#define IFX_SBCU_DBGRNT_ONE2_OFF (6)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE3 */
#define IFX_SBCU_DBGRNT_ONE3_LEN (2)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE3 */
#define IFX_SBCU_DBGRNT_ONE3_MSK (0x3)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE3 */
#define IFX_SBCU_DBGRNT_ONE3_OFF (10)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE4 */
#define IFX_SBCU_DBGRNT_ONE4_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE4 */
#define IFX_SBCU_DBGRNT_ONE4_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE4 */
#define IFX_SBCU_DBGRNT_ONE4_OFF (14)

/** \\brief  Length for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_LEN (32)

/** \\brief  Mask for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_OFF (0)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_OFF (16)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_LEN (2)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_MSK (0x3)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_OFF (17)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_LEN (14)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_OFF (0)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_LEN (4)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_OFF (28)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_OFF (21)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_OFF (15)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_OFF (19)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_LEN (6)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_MSK (0x3f)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_OFF (22)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_MSK (0x1)

